babysitter_app/app/views/babysitters/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."babysitter_id" = $1  [["babysitter_id", 1]]
---
  <strong>Reviews:</strong>
<% @babysitter.reviews.each do |review| %>