babysitter_app/app/controllers/babysitters_controller.rb

  def create
    @babysitter = Babysitter.new(babysitter_params)

    respond_to do |format|
      if @babysitter.save
---
INSERT INTO "babysitters" ("first_name", "last_name", "city", "phone_number", "rate", "sat_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @babysitter.update(babysitter_params)
---
UPDATE "babysitters" SET "phone_number" = $1, "updated_at" = $2 WHERE "babysitters"."id" = $3  [["phone_number", "(786)456-3054"], ["updated_at", "2016-06-06 19:53:17.226007"], ["id", 2]]

    def set_babysitter
      @babysitter = Babysitter.find(params[:id])
---
SELECT  "babysitters".* FROM "babysitters" WHERE "babysitters"."id" = $1 LIMIT 1  [["id", 2]]

    def set_babysitters
      @babysitters = Babysitter.all
---
SELECT "babysitters".* FROM "babysitters"