babysitter_app/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("body", "rating", "babysitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "She was awesome!"], ["rating", 5], ["babysitter_id", 1], ["created_at", "2016-06-07 18:15:33.531715"], ["updated_at", "2016-06-07 18:15:33.531715"]]
---
  def create
    @review = @babysitter.reviews.build(review_params)
    # respond_to do |format|
      if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."babysitter_id" = $1 AND "reviews"."id" = $2 LIMIT 1  [["babysitter_id", 1], ["id", 8]]
---
    def set_review
      @review = @babysitter.reviews.find(params[:id])

SELECT  "babysitters".* FROM "babysitters" WHERE "babysitters"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_babysitter
      @babysitter = Babysitter.find(params[:babysitter_id])